rottenpotatoes/app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "rating", "description", "release_date", "created_at", "updated_at", "director") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @movie = Movie.create!(movie_params)

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ? AND "movies"."id" != ?  [["director", "George Lucas"], ["id", 1]]
SELECT 1 AS one FROM "movies" WHERE "movies"."director" = ? AND "movies"."id" != ? LIMIT ?  [["director", "George Lucas"], ["id", 81], ["LIMIT", 1]]
---
  def show_by_director
    @movie = Movie.find(params[:id])
    if @movie.director.blank?

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "movies" SET "updated_at" = ?, "director" = ? WHERE "movies"."id" = ?  [["updated_at", "2023-10-06 21:24:59.601987"], ["director", "Ridley Scott"], ["id", 3]]
---
  def update
    @movie = Movie.find params[:id]
    @movie.update!(movie_params)